Here is the full sample
```
resource "kestra_role" "engineering_l1_role" {
  name        = "Internal Admin"
  description = "Internal Admin role for all admin access. This role can do all admin tasks."

  permissions {
    type        = "FLOW"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "EXECUTION"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "TEMPLATE"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "NAMESPACE"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "KVSTORE"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "DASHBOARD"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "USER"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "GROUP"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "ROLE"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "BINDING"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "AUDITLOG"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "SECRET"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "BLUEPRINT"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "INFRASTRUCTURE"
    permissions = ["READ"]
  }

  permissions {
    type        = "SETTING"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "APP"
    permissions = ["CREATE", "READ", "UPDATE", "DELETE"]
  }

  permissions {
    type        = "APPEXECUTION"
    permissions = ["READ", "UPDATE"]
  }

  permissions {
    type        = "ME"
    permissions = ["UPDATE"]
  }

  permissions {
    type        = "APITOKEN"
    permissions = ["CREATE", "READ", "DELETE"]
  }
}

resource "kestra_group" "engineering_l1_group" {
  name        = "Engineering L1"
  description = "Friendly description"
}

resource "kestra_binding" "engineering_l1_group_role_binding" {
  type        = "GROUP"
  external_id = kestra_group.engineering_l1_group.id
  role_id     = kestra_role.engineering_l1_role.id
}
```

Applying it back to back results in unexpected changes 
```
caxe@AsusVivoBook:~/projects/tutorial/terraformExamples$ terraform plan
var.kestra_token
  Enter a value: 

var.kestra_url
  Enter a value: 

var.tenant
  Enter a value: 


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kestra_binding.engineering_l1_group_role_binding will be created
  + resource "kestra_binding" "engineering_l1_group_role_binding" {
      + external_id = (known after apply)
      + id          = (known after apply)
      + role_id     = (known after apply)
      + tenant_id   = (known after apply)
      + type        = "GROUP"
    }

  # kestra_group.engineering_l1_group will be created
  + resource "kestra_group" "engineering_l1_group" {
      + description = "Friendly description"
      + id          = (known after apply)
      + name        = "Engineering L1"
      + tenant_id   = (known after apply)
    }

  # kestra_role.engineering_l1_role will be created
  + resource "kestra_role" "engineering_l1_role" {
      + description = "Internal Admin role for all admin access. This role can do all admin tasks."
      + id          = (known after apply)
      + is_default  = false
      + name        = "Internal Admin"
      + tenant_id   = (known after apply)

      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "DELETE",
            ]
          + type        = "APITOKEN"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "APP"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "AUDITLOG"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "BINDING"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "BLUEPRINT"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "DASHBOARD"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "EXECUTION"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "FLOW"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "GROUP"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "KVSTORE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "NAMESPACE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "ROLE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "SECRET"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "SETTING"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "TEMPLATE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "USER"
        }
      + permissions {
          + permissions = [
              + "READ",
              + "UPDATE",
            ]
          + type        = "APPEXECUTION"
        }
      + permissions {
          + permissions = [
              + "READ",
            ]
          + type        = "INFRASTRUCTURE"
        }
      + permissions {
          + permissions = [
              + "UPDATE",
            ]
          + type        = "ME"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
caxe@AsusVivoBook:~/projects/tutorial/terraformExamples$ terraform apply
var.kestra_token
  Enter a value: 

var.kestra_url
  Enter a value: 

var.tenant
  Enter a value: 


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kestra_binding.engineering_l1_group_role_binding will be created
  + resource "kestra_binding" "engineering_l1_group_role_binding" {
      + external_id = (known after apply)
      + id          = (known after apply)
      + role_id     = (known after apply)
      + tenant_id   = (known after apply)
      + type        = "GROUP"
    }

  # kestra_group.engineering_l1_group will be created
  + resource "kestra_group" "engineering_l1_group" {
      + description = "Friendly description"
      + id          = (known after apply)
      + name        = "Engineering L1"
      + tenant_id   = (known after apply)
    }

  # kestra_role.engineering_l1_role will be created
  + resource "kestra_role" "engineering_l1_role" {
      + description = "Internal Admin role for all admin access. This role can do all admin tasks."
      + id          = (known after apply)
      + is_default  = false
      + name        = "Internal Admin"
      + tenant_id   = (known after apply)

      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "DELETE",
            ]
          + type        = "APITOKEN"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "APP"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "AUDITLOG"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "BINDING"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "BLUEPRINT"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "DASHBOARD"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "EXECUTION"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "FLOW"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "GROUP"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "KVSTORE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "NAMESPACE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "ROLE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "SECRET"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "SETTING"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "TEMPLATE"
        }
      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "UPDATE",
              + "DELETE",
            ]
          + type        = "USER"
        }
      + permissions {
          + permissions = [
              + "READ",
              + "UPDATE",
            ]
          + type        = "APPEXECUTION"
        }
      + permissions {
          + permissions = [
              + "READ",
            ]
          + type        = "INFRASTRUCTURE"
        }
      + permissions {
          + permissions = [
              + "UPDATE",
            ]
          + type        = "ME"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kestra_group.engineering_l1_group: Creating...
kestra_role.engineering_l1_role: Creating...
kestra_role.engineering_l1_role: Creation complete after 1s [id=5BlhmoWLuFrKsWAzxGS08s]
kestra_group.engineering_l1_group: Creation complete after 1s [id=5mIDC0QhK2lp6e20GxXghy]
kestra_binding.engineering_l1_group_role_binding: Creating...
kestra_binding.engineering_l1_group_role_binding: Creation complete after 0s [id=3yFHF5slOpwhNdniYs0HWU]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
caxe@AsusVivoBook:~/projects/tutorial/terraformExamples$ terraform apply
var.kestra_token
  Enter a value: 

var.kestra_url
  Enter a value: 

var.tenant
  Enter a value: 

kestra_group.engineering_l1_group: Refreshing state... [id=5mIDC0QhK2lp6e20GxXghy]
kestra_role.engineering_l1_role: Refreshing state... [id=5BlhmoWLuFrKsWAzxGS08s]
kestra_binding.engineering_l1_group_role_binding: Refreshing state... [id=3yFHF5slOpwhNdniYs0HWU]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # kestra_role.engineering_l1_role will be updated in-place
  ~ resource "kestra_role" "engineering_l1_role" {
        id          = "5BlhmoWLuFrKsWAzxGS08s"
        name        = "Internal Admin"
        # (3 unchanged attributes hidden)

      + permissions {
          + permissions = [
              + "CREATE",
              + "READ",
              + "DELETE",
            ]
          + type        = "APITOKEN"
        }
      + permissions {
          + permissions = [
              + "READ",
            ]
          + type        = "INFRASTRUCTURE"
        }
      + permissions {
          + permissions = [
              + "UPDATE",
            ]
          + type        = "ME"
        }

        # (16 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 
```